In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_json(r"D:\01-Works\00-Doc-to-Sync\0-Download\Sarcasm_Headlines_Dataset.json")
df

ValueError: Trailing data

In [42]:
df = pd.read_csv(r"D:\18-DS\LJMU\Resources\Hindi_SA_Text\hi_3500.csv", header=None)
df.rename(columns={0:"Message",1:"Target"}, inplace=True)
df

                                                Message    Target
0     लोग वतन तक खा जाते हैं इसका इसे यकीन नहींमान ज...  negative
1     गुमनाम है वतन पर मिटने वाले लोग आतन्कवादियों स...  negative
2     ज़ंजीर बदली जा रही थी मैं समझा था रिहाई हो गयी है  negative
3     यूपी में बड़े स्तर पर दंगे करवा सकती है बीजेपी...  negative
4     अंग्रेजी नहीं आती है इसलिए हिन्दी ट्विट ज्यादा...  negative
...                                                 ...       ...
9072  RT @aajtak: #Mojo बजरंग बली का सबसे विशालकाय र...   neutral
9073  RT @aajtak: कहां अचानक स्कूल में पड़ा मंत्री क...   neutral
9074  RT @aajtak: #MoJo सुनिए कुलभूषण की दर्दभरी आपब...   neutral
9075  RT @aajtak: लव जेहाद के नाम पर क्या उत्तर प्रद...   neutral
9076  कश्मीर में हमारे जवानों से ऐसा सलूक? वीडियो दे...   neutral

[9077 rows x 2 columns]

In [44]:
df.Target.unique()

array(['negative', 'positive', 'neutral'], dtype=object)

In [41]:
a=list( zip( list(df.tail(10).Message), df.tail(10).Target ))
a

[('RT @aajtak: कश्मीर में हमारे जवानों से ऐसा सलूक? वीडियो देखेंगे तो खून खौल जाएगा...\n#MOJO\nअन्य वीडियो के लिए क्लिक करें https://t.co/0lHmKy…',
  'neutral'),
 ('RT @aajtak: #MoJo ऐसे लूट लिया दोस्त को... देखिए LIVE वीडियो...\nअन्य वीडियो देखें-https://t.co/0lHmKyYioS https://t.co/ZMKVGM315G',
  'neutral'),
 ("RT @aajtak: #MoJo योगी सरकार का 'रेड' अलर्ट... क्या हुआ जब परिवहन विभाग के दफ्तर पहुंचे मंत्री ?\nअन्य वीडियो देखें-https://t.co/0lHmKyGH0i…",
  'neutral'),
 ('RT @aajtak: योगी के मंत्रियों के छापे से हड़कंप... क्या हुआ जब खुल गई पोल? #MoJo\nअन्य वीडियो देखें- https://t.co/0lHmKyGH0i https://t.co/31…',
  'neutral'),
 ('RT @aajtak: #Mojo, विराट का इंतजार हुआ खत्म... अब होगा धूम-धड़ाका...\nअन्य वीडियो देखें-https://t.co/0lHmKyGH0i https://t.co/GpBF3NJekM',
  'neutral'),
 ("RT @aajtak: #Mojo बजरंग बली का सबसे विशालकाय रूप... कीजिए 'साक्षात्' दर्शन...\nअन्य वीडियो देखें-https://t.co/0lHmKyYioS https://t.co/MBt3Nj…",
  'neutral'),
 ('RT @aajtak: कहां अचानक स्कूल में पड़ा मंत्री का छापा? फिर क्या हुआ देखिए LIVE वीडियो #MoJo\nअन्य वीडियो देखें- https://t.co/0lHmKyGH0i https…',
  'neutral'),
 ('RT @aajtak: #MoJo सुनिए कुलभूषण की दर्दभरी आपबीती...\nअन्य वीडियो देखें-https://t.co/0lHmKyGH0i https://t.co/NRe74jyAed',
  'neutral'),
 ('RT @aajtak: लव जेहाद के नाम पर क्या उत्तर प्रदेश में हो रही है गुंडागर्दी? देखिए #Hallabol @anjanaomkashyap\nhttps://t.co/fOz5QPkk43 https:…',
  'neutral'),
 ('कश्मीर में हमारे जवानों से ऐसा सलूक? वीडियो देखेंगे तो खून खौल जाएगा...\n#MOJO\n\nhttps://t.co/seqEvYjODe',
  'neutral')]

In [11]:
df = pd.read_json(r"D:\18-DS\LJMU\Research_Datasets\NLU-SQuAD2.0\dev-v2.0.json")

In [32]:
x=df[:1].data

In [21]:
x=df[:1].data
x

0    {'title': 'Normans', 'paragraphs': [{'qas': [{...
Name: data, dtype: object

# Series

In [4]:
x=[1,2,3,4,5,6,7]
y=np.array(x)
obj1 = pd.Series([1,2,3,4,-5])
obj2= pd.Series(x)
obj3=pd.Series(y)
print (obj1.values)

[ 1  2  3  4 -5]

In [6]:
obj4= pd.Series(x, index=['a','b','c','d','e',6,7])

In [7]:
print (obj4[obj4>3])

d    4
e    5
6    6
7    7
dtype: int64

In [ ]:
c=3
print (obj4*c)

In [ ]:
obj4.index=[0,1,2,3,4,5,6]

# DataFrame

In [3]:
import pandas as pd

In [4]:
data = { "City": ["Mumbai","Delhi"], "Population":[1.5,1.2], "Year":["2010","2011"]}

In [5]:
df1 = pd.DataFrame(data)
df1

     City  Population  Year
0  Mumbai         1.5  2010
1   Delhi         1.2  2011

In [68]:
print(1, df1.City.str[:3:]) #from the start print till 3rd letter
print(2, df1.City.str[:-3:]) #if string len L then from strat to till L-3 sprint all letter
print(3, df1.City.str[::-1])
print(4, df1.City.str[:3:-1]) #On reversed string [leave last 4 letters (n+1) NOT take 0,1,2 letters]
print(5, df1.City.str[:-3:-1])  #On reversed string [Take first 2 letters (n-1) NOT take 0,1,2 letters]

1 0    Mum
1    Del
Name: City, dtype: object
2 0    Mum
1     De
Name: City, dtype: object
3 0    iabmuM
1     ihleD
Name: City, dtype: object
4 0    ia
1     i
Name: City, dtype: object
5 0    ia
1    ih
Name: City, dtype: object

In [59]:
#1 Start+      Stop+      Step+
print(1, df1.City.str[::1])
#2 Start+      Stop+      Step-
print(2, df1.City.str[::-1])
#3 Start+      Stop-      Step+
print(3, df1.City.str[:-1:])
print(3, df1.City.str[:1:])
#4 Start+      Stop-      Step-
print(4, df1.City.str[:-4:-1])

1 0    Mumbai
1     Delhi
Name: City, dtype: object
2 0    iabmuM
1     ihleD
Name: City, dtype: object
3 0    Mumba
1     Delh
Name: City, dtype: object
3 0    M
1    D
Name: City, dtype: object
4 0    iab
1    ihl
Name: City, dtype: object

In [58]:
#5 Start-      Stop+      Step+
print(5, df1.City.str[-1::])
#6 Start-      Stop+      Step-
print(6, df1.City.str[-1::-1])
#7 Start-      Stop-      Step+
print(7, df1.City.str[-5:-1:])
#8 Start-      Stop-      Step-
print(8, df1.City.str[:-1:-1])
print(8, df1.City.str[:1:-1])

5 0    i
1    i
Name: City, dtype: object
6 0    iabmuM
1     ihleD
Name: City, dtype: object
7 0    umba
1    Delh
Name: City, dtype: object
8 0
1
Name: City, dtype: object
8 0    iabm
1     ihl
Name: City, dtype: object

In [ ]:
Step -ve means reverse the string
Start -ve meanas pickup letters from backof the string
Strop -ve means

In [27]:
df1.City.str[::-1]

0    iabmuM
1     ihleD
Name: City, dtype: object

In [33]:
df1.City.str[-1::-1] #same as [::-1]

0    iabmuM
1     ihleD
Name: City, dtype: object

In [32]:
df1.City.str[-2::-1] #Reverse the string and drop first 1 letter from that reversed string

0    abmuM
1     hleD
Name: City, dtype: object

In [25]:
df1.City.str[-4::] #Take last 4 letter

0    mbai
1    elhi
Name: City, dtype: object

In [20]:
df1.City.str[::-1].str[:3:]

0    iab
1    ihl
Name: City, dtype: object

In [10]:
df2= pd.DataFrame(data, columns=['Year','Population',"City"])
df2

   Year  Population    City
0  2010         1.5  Mumbai
1  2011         1.2   Delhi

In [11]:
df2= pd.DataFrame(data, columns=['Year','Population',"City","GDP"],index=['a','b'])
df2

   Year  Population    City  GDP
a  2010         1.5  Mumbai  NaN
b  2011         1.2   Delhi  NaN

In [12]:
print (df2.Year.dtype)

object

In [13]:
print (df2.dtypes)

Year           object
Population    float64
City           object
GDP            object
dtype: object

In [14]:
df2.loc['a']

Year            2010
Population       1.5
City          Mumbai
GDP              NaN
Name: a, dtype: object

In [16]:
df2.GDP=10
df2

   Year  Population    City  GDP
a  2010         1.5  Mumbai   10
b  2011         1.2   Delhi   10

In [17]:
df2.GDP = np.arange(2)
df2

   Year  Population    City  GDP
a  2010         1.5  Mumbai    0
b  2011         1.2   Delhi    1

In [18]:
df2.GDP= np.random.randint(100,200,2)
df2

   Year  Population    City  GDP
a  2010         1.5  Mumbai  139
b  2011         1.2   Delhi  177

In [19]:
val = pd.Series([-1.4,2], index=["a",2])
val

a   -1.4
2    2.0
dtype: float64

In [21]:
df2.GDP = val
df2

   Year  Population    City  GDP
a  2010         1.5  Mumbai -1.4
b  2011         1.2   Delhi  NaN

In [23]:
df5= pd.DataFrame( {"a": np.random.randn(1000)+1, "b":np.random.randn(1000), 
                    "c":np.random.randn(1000)-1}, columns=['a','b','c'])
df5.head()

          a         b         c
0  0.240403 -0.425076  0.351914
1  1.282235 -0.483986 -0.526504
2  0.104294  1.275221 -0.355272
3  0.622375 -1.860401  0.427996
4  0.156488  1.092026 -1.665428

In [28]:
s1 = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000',periods=1000)).cumsum()
s1.head()

2000-01-01   -1.348336
2000-01-02   -3.558980
2000-01-03   -4.726340
2000-01-04   -4.963703
2000-01-05   -5.134851
Freq: D, dtype: float64

In [27]:

df5= pd.DataFrame(np.random.randn(1000,4), index=s1.index, columns=list("ABCD")).cumsum()
df5.head()

                   A         B         C         D
2000-01-01  3.157540 -0.677201  0.271374 -0.906515
2000-01-02  3.697167 -0.099747  1.295519 -1.140826
2000-01-03  2.920725 -0.304164  2.483843 -0.030209
2000-01-04  4.298310  1.040381  1.831462  1.270878
2000-01-05  5.205148  3.360128  2.376199  3.431753

In [33]:
df5.diff(periods=-1,axis=0).head(5)

                   A         B         C         D
2000-01-01 -0.539628 -0.577454 -1.024145  0.234311
2000-01-02  0.776442  0.204417 -1.188324 -1.110617
2000-01-03 -1.377584 -1.344545  0.652381 -1.301087
2000-01-04 -0.906839 -2.319747 -0.544737 -2.160875
2000-01-05 -1.080732  0.979750 -0.025666 -0.750226

In [35]:
np.random.seed(1234)
df_box = pd.DataFrame(np.random.randn(50,2))
df_box["g"]= np.random.choice( ["Cat","Rat","Mat"], size=50)
df_box.head()

          0         1    g
0  0.471435 -1.190976  Mat
1  1.432707 -0.312652  Mat
2 -0.720589  0.887163  Rat
3  0.859588 -0.636524  Cat
4  0.015696 -2.242685  Cat

In [ ]:
pd.DataFrame( list (zip( np.random.randint(1,50,30), 
                        np.random.randint(1,6,30))), columns=["Sal","Exp"]).applymap(lambda x: x**2)

In [ ]:
list(zip( np.random.randint(1,30,30), np.random.randint(1,30,30)))

In [ ]:
pd.DataFrame(np.random.randint(1,20,30)).applymap(lambda x: x**2)

In [37]:
price = pd.Series( np.random.randn(150).cumsum(), 
                  index=pd.date_range("2017-1-1",periods=150, freq='D') )
ma = price.rolling(5).mean()
mstd=price.rolling(5).std()
print (ma, mstd)

2017-01-01          NaN
2017-01-02          NaN
2017-01-03          NaN
2017-01-04          NaN
2017-01-05    -1.608894
2017-01-06    -1.250663
2017-01-07    -0.925488
2017-01-08    -0.715547
2017-01-09    -0.749213
2017-01-10    -0.879686
2017-01-11    -1.091181
2017-01-12    -1.268771
2017-01-13    -1.433471
2017-01-14    -1.442342
2017-01-15    -1.464079
2017-01-16    -1.332428
2017-01-17    -1.364872
2017-01-18    -1.491146
2017-01-19    -1.396220
2017-01-20    -1.288628
2017-01-21    -1.180377
2017-01-22    -1.226858
2017-01-23    -1.622447
2017-01-24    -2.330800
2017-01-25    -3.181732
2017-01-26    -4.071849
2017-01-27    -4.680421
2017-01-28    -4.864092
2017-01-29    -4.627233
2017-01-30    -4.377929
                ...
2017-05-01   -10.713989
2017-05-02   -10.409495
2017-05-03   -10.501394
2017-05-04   -10.407130
2017-05-05   -10.757034
2017-05-06   -10.841023
2017-05-07   -11.141433
2017-05-08   -11.271398
2017-05-09   -11.389595
2017-05-10   -11.294375
2017-05-11   -11.516799
2017-05-12   -11.403869
2017-05-13   -11.221534
2017-05-14   -11.022651
2017-05-15   -10.776536
2017-05-16   -10.133501
2017-05-17    -9.327337
2017-05-18    -8.673090
2017-05-19    -8.079069
2017-05-20    -7.514487
2017-05-21    -7.545748
2017-05-22    -7.810706
2017-05-23    -8.178564
2017-05-24    -8.609030
2017-05-25    -9.133444
2017-05-26    -9.423171
2017-05-27    -9.795985
2017-05-28    -9.978202
2017-05-29    -9.929761
2017-05-30    -9.743050
Freq: D, Length: 150, dtype: float64 2017-01-01         NaN
2017-01-02         NaN
2017-01-03         NaN
2017-01-04         NaN
2017-01-05    0.696020
2017-01-06    0.548038
2017-01-07    0.366715
2017-01-08    0.476344
2017-01-09    0.539514
2017-01-10    0.634093
2017-01-11    0.742795
2017-01-12    0.661602
2017-01-13    0.316488
2017-01-14    0.322158
2017-01-15    0.329006
2017-01-16    0.291979
2017-01-17    0.305498
2017-01-18    0.199741
2017-01-19    0.231464
2017-01-20    0.243799
2017-01-21    0.398153
2017-01-22    0.458124
2017-01-23    1.155887
2017-01-24    1.733780
2017-01-25    1.976170
2017-01-26    1.454866
2017-01-27    0.673626
2017-01-28    0.323226
2017-01-29    0.698415
2017-01-30    0.612620
                ...
2017-05-01    0.808430
2017-05-02    0.416337
2017-05-03    0.448007
2017-05-04    0.322277
2017-05-05    0.650680
2017-05-06    0.565891
2017-05-07    0.681021
2017-05-08    0.662359
2017-05-09    0.564727
2017-05-10    0.511167
2017-05-11    0.277124
2017-05-12    0.151481
2017-05-13    0.407736
2017-05-14    0.603745
2017-05-15    0.684407
2017-05-16    1.078931
2017-05-17    1.387102
2017-05-18    1.441083
2017-05-19    1.238815
2017-05-20    0.504171
2017-05-21    0.573958
2017-05-22    0.736740
2017-05-23    0.850458
2017-05-24    0.810550
2017-05-25    0.553225
2017-05-26    0.564245
2017-05-27    0.551872
2017-05-28    0.397907
2017-05-29    0.488949
2017-05-30    0.648425
Freq: D, Length: 150, dtype: float64

In [2]:
def rule(x, y):
    if x == 'high' and y > 10:
         return 1
    else:
         return 0
df = pd.DataFrame({ 'c1':[ 'high' ,'high', 'low', 'low'], 'c2': [0, 23, 17, 4]})
df['new'] = df.apply(lambda x: rule(x['c1'], x['c2']), axis =  1)
df.head()

     c1  c2  new
0  high   0    0
1  high  23    1
2   low  17    0
3   low   4    0

In [12]:
char=[]
i=65
while i<91:
    char.append( chr(i) )
    i+=1

    
n = np.random.randint(low=5, high=101, size=(13,2))
n1 = n[::,0]
n2 = n[::,1]

cat=np.random.randint(0,3,size=13)
char=np.array(char).reshape(2,13)
first=pd.Series( char[0])
second=pd.Series( char[1])

In [13]:
df1=pd.DataFrame( {"a":first,"b":second,"cat":cat,"n1":n1, "n2":n2} )
df1

    a  b  cat  n1  n2
0   A  N    2  61  72
1   B  O    1   7  74
2   C  P    1  89  56
3   D  Q    0  38  17
4   E  R    2  38  13
5   F  S    0  77  35
6   G  T    0  89  64
7   H  U    1  90   7
8   I  V    1  98   9
9   J  W    0   6  96
10  K  X    0  53  70
11  L  Y    1  65  64
12  M  Z    1  97  85

In [ ]:
df1[3:5]

In [ ]:
df1[::-2]

In [ ]:
df1[::2]

In [ ]:
df1.iloc[::,0:2:]

In [ ]:
df1.loc[0:3:,["a","b"] ]

In [ ]:
df1.sort_values(by="b", ascending=False)[0:4]

In [ ]:
catg = df1.groupby(cat)

In [ ]:
cg=catg.mean()
cg=cg.reset_index()
cg.drop(columns=["index"], inplace=True, axis=1)

In [ ]:
cg.cat=cg["cat"].astype(int)

In [ ]:
df1.add_prefix("ct_").head(4)

In [ ]:
df2 = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo","bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two","one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small","small", "large", "small", "small","large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": np.random.randint(10,99,9)
                   }
                  )
df2

In [ ]:
pivot_table(df2, values='D', index=['A', 'B'],  columns=['C','E'], aggfunc=np.sum)

In [ ]:
df2.pivot_table(columns=["C"], index=['A','B','C'],values=["D","E"], aggfunc=["mean","sum"])

In [ ]:
df2.pivot_table(index=['A','B','C'], values=["D","E"],columns=["C"],  aggfunc=["mean","sum","std"])

In [1]:
import pandas as pd

# Reading the dataframe
df = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/XWvQjYY4LZWdxLvPWOj2pPwn/heart.csv')

# Write your code here




# Printing the final columns. Do not edit this part.
print(df.columns)

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [8]:
cols= list(df.columns)
i=0
while i<len(cols):
    cols[i] = cols[i].capitalize()
    i+=1
cols
df.columns = cols
df.head()

,Age,Sex,Cp,Trestbps,Chol,Fbs,Restecg,Thalach,Exang,Oldpeak,Slope,Ca,Thal,Target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1